<template>
  <v-card flat>
    <v-card-text>
      <TextSetUp :text="text1"/>
      <ImageTool :src="require('@/assets/images/chakavak/DestinationBank/destination bank first check mng.png')"/>
      <TextSetUp :text="text2"/>
      <ImageTool :src="require('@/assets/images/chakavak/DestinationBank/destination bank first check user.png')"/>
      <TextSetUp :text="text3"/>
      <ImageTool :src="require('@/assets/images/chakavak/DestinationBank/destination bank second check mng.png')"/>
      <TextSetUp :text="text4"/>
      <ImageTool :src="require('@/assets/images/chakavak/DestinationBank/paymentRequest.png')"/>
    </v-card-text>
  </v-card>
</template>

<script>
import ImageTool from "../App/ImageTool";
import TextSetUp from "../App/TextSetUp";

export default {
  name: "DestinationBank",
  components: {ImageTool, TextSetUp},
  data: () => ({
    show: false,
    text1: "مدیر بانک مقصد مغایرت ثبت شده از بانک مبدا را در قسمت کارتابل مغایرت وارده از سایر بانک ها مشاهده میکند. " +
        "پس از دبل کلیل بر روی درخواست همانند تصویر ذیل میتواند چهار مسیر را انتخاب کند. " +
        "در مسیر اول یعنی پذیرش مغایرت بدین صورت میباشد که مدیر بانک مقصد بدون نیاز به ارسال درخواست برای کارشناس خود مغایرت را پذیرفته و به ثبت اطلاعات پرداخت مغایرت که در ادامه به توضیح آن میپردازیم اقدام کند" +
        "، در مسیر دوم یعنی عدم پذیرش مغایرت نیز مدیر میتواند بدون ارسال درخواست برای کارشناس اقدام به عدم پذیرش مغایرت کند" +
        " که پس از این مغایرت مجددا برای مدیر بانک مبدا جهت تصمیم گیری ارسال میشود،" +
        " در مسیر سوم مدیر بانک مبدا میتواند مغایرت را به دلیل دارا بودن خطا در محتوا به مدیر بانک مبدا برگرداند" +
        " و در مسیر چهارم مدیر میتواند درخواست را جهت بررسی به کارشناس بانک خود ارسال کند. در تمام این مسیر ها امکان درج مستندات مربوط در قسمت مستندات ارائه شده بانک مقصد میسر میباشد." +
        "در این مثال مدیر بانک مقصد با انتخاب دکمه بررسی مغایرت توسط کارشناس این درخواست را جهت بررسی کارشناس برای او ارسال میکند.",
    text2:
        "همانند تصویر ذیل کارشناس بانک مقصد در قسمت کارتابل مغایرت وارده از سایر بانک ها درخواست را مشاهده و با دبل کلیل بر روی آن میتواند درخواست را تایید و" +
        " یا عدم تایید کند که در هر دو صورت جهت بررسی به مدیر بانک مقصد بر میگردد. کارشناس بانک مقصد نیز میتواند مستندات لازمه را در قسمت مستندات ارائه شده بانک مقصد پیوست نماید. ",
    text3:
        "در این قسمت مدیر بانک مقصد میتواند مستندات ارسالی کارشناس را بررسی کرده " +
        "و در صورت نیاز درخواست را مجددا برای کارشناس جهت بررسی ارسال کند و یا بسته به تصمیم گیری پذیرش مغایرت و عدم پذیرش مغایرت را انتخاب نماید." +
        "در این مثال فرض میگیریم که مغایرت از سمت بانک مقصد بوده و بانک مقصد گزینه پذیرش مغایرت را انتخاب میکند. ",
    text4:
        "پس از ثبت پذیرش مغایرت توسط بانک مقصد، درخواست در کارتابل مدیر بانک مقصد در قسمت منتظر ثبت دستور پرداخت قرار میگیرد." +
        "با انتخاب درخواست و دبل کلیک بر روی آن در صورتی که بانک مقصد پرداخت کننده مغایرت باشد گزینه پرداخت کننده مغایرت را انتخاب میکند" +
        "و اما در صورتی که بانک مقصد دریافت کننده مبلغ مغایرت باشد با انتخاب این گزینه دستور پرداخت " +
        "جهت پرداخت در کارتابل مدیر بانک مبدا در قسمت منتظر ثبت دستور پرداخت قرار میگیرد." +
        "مدیر بانک مبدا نیز امکان برگرداندن به بانک مقصد و یا پرداخت مغایرت را دارد."
  }),
};
</script>

<style scoped></style>
